<?php

// 28. Вывести таблицу умножения с помощью двух циклов for.



/*
  // Для наглядности 
  
for ( $i = 2; $i < 10 ; $i++ )  {
     for ( $j = 2; $j < 10 ; $j++ )  {
         echo $i . " * " . $j . "=" . ($i * $j) . "</br>";

     }
     echo "<hr>";   // и разделительная линия  <hr>
}

*/




echo '<table border="1">' ;

for ( $i = 1; $i <= 10 ; $i++ )  {

     echo "<tr>";

     for ( $j = 1; $j <= 10 ; $j++ )  {
     
     echo  "<td>" .  $i . " * " . $j . "=" . ($i * $j) . "</td>";

     }
     echo "</tr>";  
}

echo "</table>"



?>